FoamProject/blockMeshVortexShedding/kOmegaSST/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    inlet
    {
        type            patch;
        nFaces          69;
        startFace       148673;
    }
    outlet
    {
        type            patch;
        nFaces          69;
        startFace       148742;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1149;
        startFace       148811;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1149;
        startFace       149960;
    }
    leadingEdge
    {
        type            wall;
        inGroups        1(wall);
        nFaces          23;
        startFace       151109;
    }
    trailingEdge
    {
        type            wall;
        inGroups        1(wall);
        nFaces          23;
        startFace       151132;
    }
    upperSurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          184;
        startFace       151155;
    }
    lowerSurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          184;
        startFace       151339;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          150098;
        startFace       151523;
    }
)

// ************************************************************************* //
